fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ВКМ_Должности</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКонтрагенту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчетаБаза</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПланированиеОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ВКМ_Должности/ВКМ_Должности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_Должности</name>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЕжемесячныеНачисления</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.ВКМ_СпособРасчета</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();  
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)   
	
	СформироватьДвижения();
	
	РассчитатьОсновныеНачисленияОклад();
	
	РассчитатьПроцентОтВыполненныхРабот();   
	
	РассчитатьОсновныеНачисленияОтпуск();
	
	СформироватьДвиженияУдержаний(); 
	
	ПроведениеПоРегиструВзаиморасчетыССотрудниками();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьОсновныеНачисленияОклад()    
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК Норма
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	               |ГДЕ
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета = &ВидРасчета";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);  
	Запрос.Параметры.Вставить("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл    
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки-1];  
		Движение.Результат = Выборка.Факт*Движение.Размер/Выборка.Норма;
		Движение.КоличествоДней = Выборка.Факт;
	КонецЦикла;  

	
	Движения.ВКМ_ОсновныеНачисления.Записать( , Истина);
КонецПроцедуры	

Процедура РассчитатьОсновныеНачисленияОтпуск() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачисленоОсновные.Сотрудник КАК Сотрудник,
	               |	ЕСТЬNULL(НачисленоОсновные.РезультатБаза, 0) КАК СуммаОкладБаза,
	               |	НачисленоОсновные.НомерСтроки КАК НомерСтроки,
	               |	НачисленоОсновные.КоличествоДней КАК Дней,
	               |	ЕСТЬNULL(НачисленоДополнительные.РезультатБаза, 0) КАК СуммаДополнительныхБаза
	               |ПОМЕСТИТЬ ВТ_БазовыеНачисления
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
	               |			&ИзмеренияОсновного,
	               |			&ИзмеренияБазового,
	               |			,
	               |			Регистратор = &Ссылка
	               |				И ВидРасчета = &ВидРасчета) КАК НачисленоОсновные
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
	               |				&ИзмеренияОсновного,
	               |				&ИзмеренияБазового,
	               |				,
	               |				Регистратор = &Ссылка
	               |					И ВидРасчета = &ВидРасчета) КАК НачисленоДополнительные
	               |		ПО НачисленоОсновные.Сотрудник = НачисленоДополнительные.Сотрудник
	               |			И НачисленоОсновные.Регистратор = НачисленоДополнительные.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_БазовыеНачисления.Сотрудник КАК Сотрудник,
	               |	ВТ_БазовыеНачисления.СуммаОкладБаза КАК СуммаОкладБаза,
	               |	ВТ_БазовыеНачисления.НомерСтроки КАК НомерСтроки,
	               |	ВТ_БазовыеНачисления.Дней КАК Дней,
	               |	ВТ_БазовыеНачисления.СуммаДополнительныхБаза КАК СуммаДополнительныхБаза,
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеБазовыйПериод КАК РабочихДнейБаза
	               |ИЗ
	               |	ВТ_БазовыеНачисления КАК ВТ_БазовыеНачисления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	               |				Регистратор = &Ссылка
	               |					И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	               |		ПО ВТ_БазовыеНачисления.Сотрудник = ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник
	               |			И ВТ_БазовыеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки";
	
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.Параметры.Вставить("ИзмеренияБазового", Измерения);
	Запрос.Параметры.Вставить("ИзмеренияОсновного", Измерения);   
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];   
		Движение.Размер = Выборка.СуммаОкладБаза + Выборка.СуммаДополнительныхБаза;

		Если Выборка.РабочихДнейБаза <> 0 Тогда
			Движение.Результат = ((Выборка.СуммаОкладБаза + Выборка.СуммаДополнительныхБаза)/Выборка.РабочихДнейБаза)*Выборка.Дней;
		Иначе
			Движение.Результат = 0;
		КонецЕсли;	

	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);

КонецПроцедуры


Процедура РассчитатьПроцентОтВыполненныхРабот()   
	
	
	//Расчет процента от выполненных работ 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
	               |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_ДополнительныеНачисления.Размер КАК Размер
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.ВидРасчета  = &ВидРасчета
	               |	И ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка";
	
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("ВидРасчета", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентОтРабот);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		Движение = Движения.ВКМ_ДополнительныеНачисления[Выборка.НомерСтроки - 1];
		Движение.Результат = Выборка.Размер;
	КонецЦикла;	
	
	Движения.ВКМ_ДополнительныеНачисления.Записать(, Истина);
	
КонецПроцедуры	


Процедура СформироватьДвижения()   
	
	Запрос = Новый Запрос;
	//Запрос.Текст =  "ВЫБРАТЬ
	//                |	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
	//                |	ВКМ_НачислениеЗарплатыНачисления.НомерСтроки КАК НомерСтроки,
	//                |	ВКМ_НачислениеЗарплатыНачисления.График КАК График,
	//                |	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
	//                |	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
	//                |	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
	//                |	ВКМ_НачислениеЗарплатыНачисления.Размер КАК Размер,
	//                |	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета.СпособРасчета КАК ВидРасчетаСпособРасчета
	//                |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	//                |ИЗ
	//                |	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
	//                |ГДЕ
	//                |	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	//                |;
	//                |
	//                |////////////////////////////////////////////////////////////////////////////////
	//                |ВЫБРАТЬ
	//                |	ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник,
	//                |	ВТ_ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	//                |	ВТ_ДанныеДокумента.График КАК График,
	//                |	ВТ_ДанныеДокумента.ВидРасчета КАК ВидРасчета,
	//                |	ВТ_ДанныеДокумента.ДатаНачала КАК ДатаНачала,
	//                |	ВТ_ДанныеДокумента.ДатаОкончания КАК ДатаОкончания,
	//                |	ВТ_ДанныеДокумента.Размер КАК Размер,
	//                |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	//                |	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаОплатыОборот, 0) КАК СуммаОплатыРабот,
	//                |	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.ЧасовКОплатеОборот, 0) КАК ЧасовКОплате,
	//                |	ВТ_ДанныеДокумента.ВидРасчетаСпособРасчета КАК СпособРасчета,
	//                |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	//                |ИЗ
	//                |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	//                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&НачалоПериода, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	//                |		ПО ВТ_ДанныеДокумента.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	//                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &ОкончаниеПериода, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	//                |		ПО ВТ_ДанныеДокумента.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник";
	
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
	                |	ВКМ_НачислениеЗарплатыНачисления.НомерСтроки КАК НомерСтроки,
	                |	ВКМ_НачислениеЗарплатыНачисления.График КАК График,
	                |	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
	                |	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
	                |	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
	                |	ВКМ_НачислениеЗарплатыНачисления.Размер КАК Размер,
	                |	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета.СпособРасчета КАК ВидРасчетаСпособРасчета
	                |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	                |ИЗ
	                |	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
	                |ГДЕ
	                |	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник,
	                |	ВТ_ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	                |	ВТ_ДанныеДокумента.График КАК График,
	                |	ВТ_ДанныеДокумента.ВидРасчета КАК ВидРасчета,
	                |	ВТ_ДанныеДокумента.ДатаНачала КАК ДатаНачала,
	                |	ВТ_ДанныеДокумента.ДатаОкончания КАК ДатаОкончания,
	                |	ВТ_ДанныеДокумента.Размер КАК Размер,
	                |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	                |	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаОплатыОборот, 0) КАК СуммаОплатыРабот,
	                |	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.ЧасовКОплатеОборот, 0) КАК ЧасовКОплате,
	                |	ВТ_ДанныеДокумента.ВидРасчетаСпособРасчета КАК СпособРасчета,
	                |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
	                |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКонтрагентуОборот КАК СуммаКонтрагенту
	                |ИЗ
	                |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&НачалоПериода, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	                |		ПО ВТ_ДанныеДокумента.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &ОкончаниеПериода, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	                |		ПО ВТ_ДанныеДокумента.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник";
	
	
	Запрос.Параметры.Вставить("НачалоПериода", НачалоМесяца(Дата));
	Запрос.Параметры.Вставить("ОкончаниеПериода", КонецМесяца(Дата)); 
	Запрос.Параметры.Вставить("Ссылка", Ссылка);  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл  
		// регистр ВКМ_ОсновныеНачисления
		Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ОсновныеНачисления") Тогда
			  	Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
				Движение.Сторно = Ложь;
				Движение.ВидРасчета = Выборка.ВидРасчета;
				Движение.ПериодДействияНачало = Выборка.ДатаНачала;
				Движение.ПериодДействияКонец = Выборка.ДатаОкончания;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = Выборка.Сотрудник; 
				
				Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
					Движение.Размер = Выборка.Оклад;
				Иначе
					Движение.Размер = Выборка.Размер;
				КонецЕсли;	
				Движение.График = Выборка.График; 
				
				
				Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
					Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Выборка.ДатаНачала, -12));  
					Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Выборка.ДатаОкончания, -1));  
					//календарные дни отпуска
					Движение.КоличествоДней = (Выборка.ДатаОкончания - Выборка.ДатаНачала)/86400; //86400 - колво секунд в одном днне
				КонецЕсли;	
		КонецЕсли;	
	

	// регистр ВКМ_ДополнительныеНачисления
		Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда				
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = Выборка.ВидРасчета;
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = Выборка.Сотрудник;
			
			Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентОтРабот Тогда 
				Движение.Размер = Выборка.СуммаКонтрагенту*Выборка.ПроцентОтРабот/100;
			Иначе	
				Движение.Размер = Выборка.Размер; 
			КонецЕсли;					
		КонецЕсли;		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	

КонецПроцедуры

Процедура СформироватьДвиженияУдержаний() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	               |	ВКМ_ОсновныеНачисления.Результат КАК Результат,
	               |	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	               |	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	               |ГДЕ
	               |	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.НомерСтроки,
	               |	ВКМ_ДополнительныеНачисления.Результат,
	               |	ВКМ_ДополнительныеНачисления.ВидРасчета,
	               |	ВКМ_ДополнительныеНачисления.Сотрудник
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка"; 
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Движения.ВКМ_Удержания.Записывать = Истина;
		
		ПроцентНДФЛ = 13;
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ВидРасчетаБаза = Выборка.ВидРасчета; 
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;  		
		Движение.Размер = Выборка.Результат;
		Движение.Результат = Движение.Размер*ПроцентНДФЛ/100;   
		
	КонецЦикла;	
	Движения.ВКМ_Удержания.Записать();
КонецПроцедуры	

Процедура ПроведениеПоРегиструВзаиморасчетыССотрудниками()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_ОсновныеНачисления.Результат КАК Начислено
	               |ПОМЕСТИТЬ ВТ_Начисления
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	               |ГДЕ
	               |	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.Сотрудник,
	               |	ВКМ_ДополнительныеНачисления.Результат
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВКМ_Удержания.Результат) КАК Удержания,
	               |	ВКМ_Удержания.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ВТ_Удержено
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |ГДЕ
	               |	ВКМ_Удержания.Регистратор = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_Удержания.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Начисления.Сотрудник КАК Сотрудник,
	               |	СУММА(ВТ_Начисления.Начислено) КАК Начислено
	               |ПОМЕСТИТЬ ВТ_ВсегоНачислено
	               |ИЗ
	               |	ВТ_Начисления КАК ВТ_Начисления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Начисления.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Удержено.Удержания КАК Удержания,
	               |	ВТ_ВсегоНачислено.Начислено КАК Начислено,
	               |	ВТ_ВсегоНачислено.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	ВТ_ВсегоНачислено КАК ВТ_ВсегоНачислено
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Удержено КАК ВТ_Удержено
	               |		ПО ВТ_ВсегоНачислено.Сотрудник = ВТ_Удержено.Сотрудник";
	
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Пока  Выборка.Следующий() Цикл 
		 Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		 Движение.Период = Дата;
		 Движение.Сотрудник = Выборка.Сотрудник;
		 Движение.Сумма = Выборка.Начислено - Выборка.Удержания;  
	 КонецЦикла;	
	
 КонецПроцедуры	
 
Процедура ВыполнитьАвтозаполнение(ДатаДокумента)  Экспорт
	 Начисления.Очистить();
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ВКМ_ФизическиеЛица.Ссылка КАК Ссылка,
	                |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Должность КАК Должность,
	                |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	                |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
	                |	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.ЧасовКОплатеОборот, 0) КАК ЧасыКОплате
	                |ПОМЕСТИТЬ ВТ_ДолжностиСотрудников
	                |ИЗ
	                |	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&НачалоПериода, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	                |		ПО (ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = ВКМ_ФизическиеЛица.Ссылка)
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	                |		ПО ВКМ_ФизическиеЛица.Ссылка = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
	                |ГДЕ
	                |	НЕ ВКМ_ФизическиеЛица.ПометкаУдаления
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_ДолжностиСотрудников.Ссылка КАК Сотрудник,
	                |	ВТ_ДолжностиСотрудников.Оклад КАК Оклад,
	                |	ВТ_ДолжностиСотрудников.ПроцентОтРабот КАК ПроцентОтРабот,
	                |	ВКМ_ДолжностиЕжемесячныеНачисления.Начисление КАК Начисление,
	                |	ВКМ_ДолжностиЕжемесячныеНачисления.Ссылка.ГрафикРаботы КАК ГрафикРаботы,
	                |	ВТ_ДолжностиСотрудников.ЧасыКОплате КАК ЧасыКОплате
	                |ИЗ
	                |	ВТ_ДолжностиСотрудников КАК ВТ_ДолжностиСотрудников
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВКМ_Должности.ЕжемесячныеНачисления КАК ВКМ_ДолжностиЕжемесячныеНачисления
	                |		ПО ВТ_ДолжностиСотрудников.Должность = ВКМ_ДолжностиЕжемесячныеНачисления.Ссылка";
	 
	 Запрос.Параметры.Вставить("НачалоПериода", НачалоМесяца(ДатаДокумента)); 
	 Запрос.Параметры.Вставить("КонецПериода", КонецМесяца(ДатаДокумента));
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 Если Выборка.Начисление = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентОтРабот 
			 И Выборка.ЧасыКОплате = 0 Тогда 
			 Продолжить;
		 КонецЕсли;	
		 
		 НоваяСтрока = Начисления.Добавить();
		 НоваяСтрока.Сотрудник = Выборка.Сотрудник; 		 
		 НоваяСтрока.График = Выборка.ГрафикРаботы;
		 НоваяСтрока.ВидРасчета = Выборка.Начисление;
		 НоваяСтрока.ДатаНачала = НачалоМесяца(Дата);
		 НоваяСтрока.ДатаОкончания = КонецМесяца(Дата);
	 КонецЦикла;	
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
		 |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		 |	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		 |	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
		 |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Должность.ГрафикРаботы КАК ГрафикРаботы
		 |ИЗ
		 |	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		 |		ПО ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		 |ГДЕ
		 |	НАЧАЛОПЕРИОДА(ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Год, ГОД) = НАЧАЛОПЕРИОДА(&ДатаДокумента, ГОД)
		 |	И (МЕСЯЦ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала) = МЕСЯЦ(&ДатаДокумента)
		 |			ИЛИ МЕСЯЦ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания) = МЕСЯЦ(&ДатаДокумента)
		 |			ИЛИ ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала < НАЧАЛОПЕРИОДА(&ДатаДокумента, МЕСЯЦ)
		 |				И ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания > КОНЕЦПЕРИОДА(&ДатаДокумента, МЕСЯЦ))";
		 
	 
	 Запрос.Параметры.Вставить("ДатаДокумента", ДатаДокумента);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Начисления.Добавить();
		 НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		 НоваяСтрока.График = Выборка.ГрафикРаботы;
		 НоваяСтрока.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
		 
		 НоваяСтрока.ДатаНачала = Макс(НачалоМесяца(Дата), Выборка.ДатаНачала);
		 НоваяСтрока.ДатаОкончания = Мин(КонецМесяца(Дата), Выборка.ДатаОкончания);
	 КонецЦикла;
	 
	 Начисления.Сортировать("Сотрудник");
 КонецПроцедуры	 
#КонецОбласти
	


#КонецЕсли
